Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveInView Property
 Can't move element because the move plane is seen at a very sharp angle in this View
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveInView { get; }
Public Shared ReadOnly Property CannotMoveInView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveInView {
	FailureDefinitionId^ get ();
}
static member CannotMoveInView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace